results.log
catacumba-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    14.51ms   12.68ms 271.82ms   90.24%
    Req/Sec     2.56k   281.53     5.77k    84.38%
  1836148 requests in 1.00m, 157.60MB read
Requests/sec:  30553.82
Transfer/sec:      2.62MB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.04ms    2.84ms  73.32ms   93.94%
    Req/Sec   806.60     56.17     1.00k    73.28%
  578392 requests in 1.00m, 49.64MB read
Requests/sec:   9630.79
Transfer/sec:    846.46KB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.50ms    2.85ms  96.17ms   92.54%
    Req/Sec   406.11     40.88   626.00     68.18%
  291376 requests in 1.00m, 25.01MB read
Requests/sec:   4849.73
Transfer/sec:    426.25KB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    61.80ms    3.42ms 120.68ms   92.30%
    Req/Sec   271.78     41.71   333.00     72.80%
  194916 requests in 1.00m, 16.73MB read
Requests/sec:   3244.77
Transfer/sec:    285.18KB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    81.65ms    3.27ms 147.14ms   92.96%
    Req/Sec   205.15     73.62   333.00     66.27%
  146659 requests in 1.00m, 12.59MB read
Requests/sec:   2441.07
Transfer/sec:    214.55KB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   101.52ms    2.76ms 136.49ms   92.87%
    Req/Sec   164.04     88.38   323.00     61.60%
  117610 requests in 1.00m, 10.09MB read
Requests/sec:   1957.00
Transfer/sec:    172.00KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   151.97ms    3.69ms 204.54ms   93.18%
    Req/Sec   114.44     77.76   323.00     68.07%
  78502 requests in 1.00m, 6.74MB read
Requests/sec:   1306.21
Transfer/sec:    114.80KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   202.28ms    4.17ms 251.28ms   92.54%
    Req/Sec   106.40     95.29   323.00     68.47%
  58952 requests in 1.00m, 5.06MB read
Requests/sec:    981.61
Transfer/sec:     86.27KB
------------------------------------------

benchmark [250 ms]:
Running 1m test @ http://localhost:8080/?delay=250
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   251.86ms    3.13ms 289.24ms   93.27%
    Req/Sec    88.83     79.25   323.00     79.21%
  47124 requests in 1.00m, 4.04MB read
Requests/sec:    784.09
Transfer/sec:     68.91KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   302.42ms    5.23ms 377.41ms   93.32%
    Req/Sec    82.09     83.51   323.00     81.63%
  39204 requests in 1.00m, 3.36MB read
Requests/sec:    652.45
Transfer/sec:     57.34KB
------------------------------------------

==========================================


luminus-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.41ms   99.58ms   1.16s    97.37%
    Req/Sec     1.07k   167.58     2.52k    81.58%
  742413 requests in 1.00m, 252.06MB read
Requests/sec:  12353.86
Transfer/sec:      4.19MB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   250.22ms   22.11ms 389.39ms   95.95%
    Req/Sec   124.53     85.89   333.00     60.92%
  87800 requests in 1.00m, 29.81MB read
Requests/sec:   1460.95
Transfer/sec:    507.91KB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   482.02ms   34.12ms 674.93ms   95.92%
    Req/Sec    89.87     82.28   323.00     71.38%
  45308 requests in 1.00m, 15.38MB read
Requests/sec:    754.30
Transfer/sec:    262.24KB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   710.52ms   53.69ms 948.58ms   96.26%
    Req/Sec    82.75     80.80   323.00     76.68%
  30651 requests in 1.00m, 10.41MB read
Requests/sec:    510.03
Transfer/sec:    177.32KB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   935.04ms   72.02ms   1.16s    95.57%
    Req/Sec    80.72     76.78   323.00     67.65%
  23206 requests in 1.00m, 7.88MB read
Requests/sec:    386.12
Transfer/sec:    134.24KB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.16s    99.67ms   1.38s    95.94%
    Req/Sec    67.54     62.85   310.00     67.48%
  18223 requests in 1.00m, 6.19MB read
  Socket errors: connect 0, read 0, write 0, timeout 396
Requests/sec:    303.23
Transfer/sec:    105.42KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71s   166.73ms   1.98s    97.18%
    Req/Sec    48.31     43.75   200.00     68.25%
  12541 requests in 1.00m, 4.26MB read
Requests/sec:    208.68
Transfer/sec:     72.55KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.01s   515.80ms   1.81s    55.56%
    Req/Sec    32.51     34.94   220.00     84.49%
  9436 requests in 1.00m, 3.20MB read
  Socket errors: connect 0, read 0, write 0, timeout 9148
Requests/sec:    157.05
Transfer/sec:     54.60KB
------------------------------------------

benchmark [250 ms]:
Running 1m test @ http://localhost:8080/?delay=250
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12s   567.73ms   2.00s    50.20%
    Req/Sec    30.99     30.84   200.00     77.60%
  7565 requests in 1.00m, 2.57MB read
  Socket errors: connect 0, read 0, write 0, timeout 7310
Requests/sec:    125.87
Transfer/sec:     43.76KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.04s   501.46ms   1.79s    66.67%
    Req/Sec    29.44     33.95   210.00     87.06%
  6304 requests in 1.00m, 2.14MB read
  Socket errors: connect 0, read 0, write 0, timeout 6112
Requests/sec:    104.89
Transfer/sec:     36.47KB
------------------------------------------

==========================================


yada-app
benchmark [0 ms]:
Running 1m test @ http://localhost:8080/?delay=0
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    60.85ms   84.94ms   1.83s    91.26%
    Req/Sec   772.89    143.14     3.61k    82.25%
  549962 requests in 1.00m, 132.69MB read
Requests/sec:   9156.75
Transfer/sec:      2.21MB
------------------------------------------

benchmark [20 ms]:
Running 1m test @ http://localhost:8080/?delay=20
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    30.45ms   11.71ms 181.22ms   88.02%
    Req/Sec   657.07     66.29   810.00     78.68%
  471426 requests in 1.00m, 113.75MB read
Requests/sec:   7844.23
Transfer/sec:      1.89MB
------------------------------------------

benchmark [40 ms]:
Running 1m test @ http://localhost:8080/?delay=40
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.33ms    1.91ms  78.59ms   93.11%
    Req/Sec   407.10     38.53   640.00     74.78%
  292039 requests in 1.00m, 70.46MB read
Requests/sec:   4859.22
Transfer/sec:      1.17MB
------------------------------------------

benchmark [60 ms]:
Running 1m test @ http://localhost:8080/?delay=60
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    62.58ms    7.13ms 163.97ms   95.01%
    Req/Sec   269.75     39.92   333.00     71.99%
  193431 requests in 1.00m, 46.67MB read
Requests/sec:   3219.54
Transfer/sec:    795.45KB
------------------------------------------

benchmark [80 ms]:
Running 1m test @ http://localhost:8080/?delay=80
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    82.92ms    6.39ms 186.41ms   93.49%
    Req/Sec   203.14     41.70   333.00     72.34%
  145610 requests in 1.00m, 35.13MB read
Requests/sec:   2422.95
Transfer/sec:    598.64KB
------------------------------------------

benchmark [100 ms]:
Running 1m test @ http://localhost:8080/?delay=100
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   104.53ms    8.90ms 257.64ms   91.65%
    Req/Sec   161.77     39.16   323.00     72.16%
  115973 requests in 1.00m, 27.98MB read
Requests/sec:   1929.74
Transfer/sec:    476.78KB
------------------------------------------

benchmark [150 ms]:
Running 1m test @ http://localhost:8080/?delay=150
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   156.06ms    9.38ms 277.55ms   90.20%
    Req/Sec   107.98     44.90   323.00     71.43%
  77432 requests in 1.00m, 18.68MB read
Requests/sec:   1288.43
Transfer/sec:    318.33KB
------------------------------------------

benchmark [200 ms]:
Running 1m test @ http://localhost:8080/?delay=200
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   205.70ms   10.34ms 344.01ms   91.46%
    Req/Sec    83.49     49.98   323.00     69.66%
  58335 requests in 1.00m, 14.08MB read
Requests/sec:    970.84
Transfer/sec:    239.87KB
------------------------------------------

benchmark [250 ms]:
Running 1m test @ http://localhost:8080/?delay=250
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   256.69ms   12.11ms 387.56ms   91.39%
    Req/Sec    70.12     46.63   320.00     73.38%
  46705 requests in 1.00m, 11.27MB read
Requests/sec:    777.13
Transfer/sec:    192.01KB
------------------------------------------

benchmark [300 ms]:
Running 1m test @ http://localhost:8080/?delay=300
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   307.29ms   12.60ms 422.07ms   91.06%
    Req/Sec    63.24     52.08   282.00     67.89%
  38917 requests in 1.00m, 9.39MB read
Requests/sec:    647.52
Transfer/sec:    159.98KB
------------------------------------------

==========================================